//dummydata will replace by ajax call
import DummyData from '../../../dummyData/data_by_capdate'

export const RATE_DATA_CAP= 'RATE_DATA_CAP'

export function get_rate_data_cap(id){
    // const request=DummyData.allObj[''+id]
    // const request = require('json!../../../dummyData/Boyi_5s_compset.json')

    var json_data;

    // var oReq = new XMLHttpRequest();
    // oReq.onload = reqListener;
    // oReq.open("get", "../../../dummyData/Boyi_5s_compset.json", true);
    // oReq.send();

    // function reqListener(e) {
    // 	json_data = JSON.parse(this.responseText);
    // 	console.log(json_data)

    // 	const request = json_data;

	   //  console.log(request)
	   //  return {
	   //      type:RATE_DATA_CAP,
	   //      payload:request
	   //  }
    // }

    const request = [{"深圳蓝楹湾度假酒店": 2181.0, "深圳东方银座美爵酒店": 633.0, "深圳博林诺富特酒店": 664.0, "HUM": 867, "深圳华侨城蓝汐精品酒店": 1498.0, "深圳湾科技园丽雅查尔顿酒店": 745.0, "stay_date": "2016-05-13", "深圳欢乐海岸万豪行政公寓": 1764.0, "深圳华侨城洲际大酒店": 1647.0, "深圳中洲万豪酒店": 1551.0}, {"深圳蓝楹湾度假酒店": 2181.0, "深圳东方银座美爵酒店": 545.0, "深圳博林诺富特酒店": 719.0, "HUM": 848, "深圳华侨城蓝汐精品酒店": 1494.0, "深圳湾科技园丽雅查尔顿酒店": 541.0, "stay_date": "2016-05-14", "深圳欢乐海岸万豪行政公寓": 1764.0, "深圳华侨城洲际大酒店": 1647.0, "深圳中洲万豪酒店": 1551.0}, {"深圳蓝楹湾度假酒店": 1968.0, "深圳东方银座美爵酒店": 545.0, "深圳博林诺富特酒店": 719.0, "HUM": 793, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 541.0, "stay_date": "2016-05-15", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1529.0, "深圳中洲万豪酒店": 1469.0}, {"深圳蓝楹湾度假酒店": 1968.0, "深圳东方银座美爵酒店": 600.0, "深圳博林诺富特酒店": 690.0, "HUM": 817, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 713.0, "stay_date": "2016-05-16", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1453.0, "深圳中洲万豪酒店": 1652.0}, {"深圳蓝楹湾度假酒店": 1968.0, "深圳东方银座美爵酒店": 622.0, "深圳博林诺富特酒店": 690.0, "HUM": 851, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 713.0, "stay_date": "2016-05-17", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1852.0, "深圳中洲万豪酒店": 1652.0}, {"深圳蓝楹湾度假酒店": 1968.0, "深圳东方银座美爵酒店": 622.0, "深圳博林诺富特酒店": 690.0, "HUM": 838, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 745.0, "stay_date": "2016-05-18", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1653.0, "深圳中洲万豪酒店": 1652.0}, {"深圳蓝楹湾度假酒店": 1973.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 690.0, "HUM": 843, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 755.0, "stay_date": "2016-05-19", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1852.0, "深圳中洲万豪酒店": 1553.0}, {"深圳蓝楹湾度假酒店": 2181.0, "深圳东方银座美爵酒店": 518.0, "深圳博林诺富特酒店": 690.0, "HUM": 866, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 755.0, "stay_date": "2016-05-20", "深圳欢乐海岸万豪行政公寓": 1763.0, "深圳华侨城洲际大酒店": 1852.0, "深圳中洲万豪酒店": 1448.0}, {"深圳蓝楹湾度假酒店": 2181.0, "深圳东方银座美爵酒店": 518.0, "深圳博林诺富特酒店": 569.0, "HUM": 822, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 541.0, "stay_date": "2016-05-21", "深圳欢乐海岸万豪行政公寓": 1763.0, "深圳华侨城洲际大酒店": 1653.0, "深圳中洲万豪酒店": 1448.0}, {"深圳蓝楹湾度假酒店": 1973.0, "深圳东方银座美爵酒店": 518.0, "深圳博林诺富特酒店": 599.0, "HUM": 737, "深圳华侨城蓝汐精品酒店": 1381.0, "深圳湾科技园丽雅查尔顿酒店": 541.0, "stay_date": "2016-05-22", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1165.0, "深圳中洲万豪酒店": 1448.0}, {"深圳蓝楹湾度假酒店": 1973.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 569.0, "HUM": 757, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 713.0, "stay_date": "2016-05-23", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1165.0, "深圳中洲万豪酒店": 1553.0}, {"深圳蓝楹湾度假酒店": 1973.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 683.0, "HUM": 766, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 713.0, "stay_date": "2016-05-24", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1165.0, "深圳中洲万豪酒店": 1553.0}, {"深圳蓝楹湾度假酒店": 1973.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 683.0, "HUM": 766, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 713.0, "stay_date": "2016-05-25", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1165.0, "深圳中洲万豪酒店": 1553.0}, {"深圳蓝楹湾度假酒店": 1973.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 683.0, "HUM": 771, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 713.0, "stay_date": "2016-05-26", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1230.0, "深圳中洲万豪酒店": 1553.0}, {"深圳蓝楹湾度假酒店": 2181.0, "深圳东方银座美爵酒店": 518.0, "深圳博林诺富特酒店": 683.0, "HUM": 803, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 713.0, "stay_date": "2016-05-27", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1230.0, "深圳中洲万豪酒店": 1448.0}, {"深圳蓝楹湾度假酒店": 2181.0, "深圳东方银座美爵酒店": 518.0, "深圳博林诺富特酒店": 569.0, "HUM": 779, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 541.0, "stay_date": "2016-05-28", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1230.0, "深圳中洲万豪酒店": 1448.0}, {"深圳蓝楹湾度假酒店": 1973.0, "深圳东方银座美爵酒店": 518.0, "深圳博林诺富特酒店": 569.0, "HUM": 730, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 541.0, "stay_date": "2016-05-29", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1165.0, "深圳中洲万豪酒店": 1448.0}, {"深圳蓝楹湾度假酒店": 1973.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 569.0, "HUM": 757, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 713.0, "stay_date": "2016-05-30", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1165.0, "深圳中洲万豪酒店": 1553.0}, {"深圳蓝楹湾度假酒店": 1973.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 683.0, "HUM": 766, "深圳华侨城蓝汐精品酒店": 1331.0, "深圳湾科技园丽雅查尔顿酒店": 713.0, "stay_date": "2016-05-31", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1165.0, "深圳中洲万豪酒店": 1553.0}, {"深圳蓝楹湾度假酒店": 1988.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 683.0, "HUM": 799, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 728.0, "stay_date": "2016-06-01", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1308.0, "深圳中洲万豪酒店": 1658.0}, {"深圳蓝楹湾度假酒店": 1988.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 683.0, "HUM": 841, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 728.0, "stay_date": "2016-06-02", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1919.0, "深圳中洲万豪酒店": 1566.0}, {"深圳蓝楹湾度假酒店": 2188.0, "深圳东方银座美爵酒店": 518.0, "深圳博林诺富特酒店": 683.0, "HUM": 874, "深圳华侨城蓝汐精品酒店": 1501.0, "深圳湾科技园丽雅查尔顿酒店": 728.0, "stay_date": "2016-06-03", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1919.0, "深圳中洲万豪酒店": 1566.0}, {"深圳蓝楹湾度假酒店": 2188.0, "深圳东方银座美爵酒店": 518.0, "深圳博林诺富特酒店": 683.0, "HUM": 843, "深圳华侨城蓝汐精品酒店": 1501.0, "深圳湾科技园丽雅查尔顿酒店": 549.0, "stay_date": "2016-06-04", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1714.0, "深圳中洲万豪酒店": 1566.0}, {"深圳蓝楹湾度假酒店": 1988.0, "深圳东方银座美爵酒店": 518.0, "深圳博林诺富特酒店": 683.0, "HUM": 805, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 549.0, "stay_date": "2016-06-05", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1714.0, "深圳中洲万豪酒店": 1566.0}, {"深圳蓝楹湾度假酒店": 1988.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 683.0, "HUM": 824, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 728.0, "stay_date": "2016-06-06", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1714.0, "深圳中洲万豪酒店": 1566.0}, {"深圳蓝楹湾度假酒店": 1988.0, "深圳东方银座美爵酒店": 570.0, "深圳博林诺富特酒店": 683.0, "HUM": 852, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 745.0, "stay_date": "2016-06-07", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 2034.0, "深圳中洲万豪酒店": 1566.0}, {"深圳蓝楹湾度假酒店": 1988.0, "深圳东方银座美爵酒店": 600.0, "深圳博林诺富特酒店": 683.0, "HUM": 819, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 728.0, "stay_date": "2016-06-08", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1623.0, "深圳中洲万豪酒店": 1566.0}, {"深圳蓝楹湾度假酒店": 1988.0, "深圳东方银座美爵酒店": 485.0, "深圳博林诺富特酒店": 683.0, "HUM": 802, "深圳华侨城蓝汐精品酒店": 1453.0, "深圳湾科技园丽雅查尔顿酒店": 728.0, "stay_date": "2016-06-09", "深圳欢乐海岸万豪行政公寓": 1448.0, "深圳华侨城洲际大酒店": 1531.0, "深圳中洲万豪酒店": 1566.0}, {"深圳蓝楹湾度假酒店": 2188.0, "深圳东方银座美爵酒店": 485.0, "深圳博林诺富特酒店": 683.0, "HUM": 828, "深圳华侨城蓝汐精品酒店": 1501.0, "深圳湾科技园丽雅查尔顿酒店": 728.0, "stay_date": "2016-06-10", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1392.0, "深圳中洲万豪酒店": 1566.0}, {"深圳蓝楹湾度假酒店": 2188.0, "深圳东方银座美爵酒店": 485.0, "深圳博林诺富特酒店": 683.0, "HUM": 802, "深圳华侨城蓝汐精品酒店": 1501.0, "深圳湾科技园丽雅查尔顿酒店": 549.0, "stay_date": "2016-06-11", "深圳欢乐海岸万豪行政公寓": 1658.0, "深圳华侨城洲际大酒店": 1249.0, "深圳中洲万豪酒店": 1566.0}]
    console.log(request)
    return {
        type:RATE_DATA_CAP,
        payload:request
    }
}

